package com.ntu.api.controller.additional;

import javafx.fxml.FXML;
import javafx.scene.control.TextArea;
import javafx.scene.layout.AnchorPane;
import javafx.stage.Stage;


public class AboutController {

    @FXML
    AnchorPane aboutDlg;
    @FXML
    private TextArea aboutTextArea;

    private static boolean bool;

    public static void setBool(boolean bool) {
        AboutController.bool = bool;
    }

    @FXML public void initialize() {
        if (bool) {
            aboutTextArea.setText("         Програма для розрахунку конструкції дорожнього одягу «ConstRoad» призначена для розрахунку її надійності та конструкції дорожнього одягу за наступними параметрами: \n" +
                    "- за допустимим пружнім прогином, \n" +
                    "- за умовою стійкості проти зсуву у ґрунті земляного полотна,\n" +
                    "- за умовою стійкості проти зсуву у нев'язких шарах земляного покриття,\n" +
                    "- за критерієм пружного прогину. \n" +
                    "           Конструктивно програма складається з п'яти основних блоків: блоку введення даних; блоку представлення результатів розрахунків; блоку розрахункових даних, блоку оптимізації та блоку довідкових даних. \n" +
                    "            Блок введення даних призначений для вибору користувачем параметрів та умов експлуатації дорожнього покриття. \n" +
                    "            Блок довідкових даних включає в себе сукупність довідкових таблиць з нормативних документів та довідників по розрахунку конструкції дорожнього одягу. \n" +
                    "            Блок розрахункових даних включає в себе розрахунки за критерієм пружного прогину, за критерієм зсуву у ґрунті земляного полотна, за критерієм зсуву у нев'язких шарах земляного покриття, за критерієм опору шарів з монолітних матеріалів розтягу при згині. \n" +
                //    "            Блок оптимізації призначений для оптимізації товщин шарів дорожнього покриття за одним із критеріїв.\n" +
                    "            Блоку представлення результатів розрахунків призначений для формування звіту по конструкції дорожнього покриття та його збереження в зручному для перегляду форматі.");
        } else {
            aboutTextArea.setText("Алгоритм роботи з програмою:\n" +
                    "- відкрити збережену або вести нову конструкцію дорожнього покриття;\n" +
                    "- вибрати режим роботи програми: \n" +
                    "       - \"Розрахунок експлуатаційних параметрів конструкції дорожнього покриття\",\n" +
                    "       - \"Перебір можливих варіантів конструкції дорожнього одягу, які задовольняють умови надійності та експлуатаційним критеріям\";\n" +
                    "- переглянути результати розрахунку;\n" +
                  //  "- провести оптимізацію конструкції дорожнього одягу, за необхідності;\n" +
                    "- зберегти результати розрахунку, сформувавши звіт по конструкції дорожнього одягу.");
        }
    }

    @FXML public void okOnClick(){
        Stage dlg = (Stage)(aboutDlg.getScene().getWindow());
        dlg.close();
    }
}
